--- a/docs/did-authorization.md
+++ b/docs/did-authorization.md
@@ -137,18 +137,19 @@ The claim can also be approved by a delegate of a DID with the correct role. In 
 
 The following examples show how the roles for the flexhub (namespace `flexhub.roles.did.ewc.eth`) are defined.
 
-```mermaid
-graph LR
-
-    auth(Authority) --> dso(DSO)
-    auth --> tso(TSO)
-    dso --> oem(OEM)
-    oem --> iot(IoT device)
-    dso --> inst(Installer)
-    inst --> iot
-    dso --> pro(Prosumer)
-    inst --> pro
-    pro --> iot
+```plantuml
+@startuml
+    (*) --> Authority
+    Authority --> DSO
+    Authority --> TSO
+    DSO --> OEM
+    OEM --> "IoT device"
+    DSO --> Installer
+    Installer --> "IoT device"
+    DSO --> Prosumer
+    Installer --> Prosumer
+    Prosumer --> "IoT device"
+@enduml
 ```
 
 This diagram shows why we need to share trust and be able to validate roles approved by others. Indeed, if a TSO wants to talk to an IoT Device, it must trust the approvals from the DSO, OEM, Installer and Prosumer whom they have no relationship with.
@@ -247,23 +248,26 @@ Authorization is when the application determines which roles the user has or was
 
 Authentication boils down to verifying that the party connecting to an application is in possession of the private key that owns the identity it wants to connect as. The sequence of events of the happy path is
 
-```mermaid
-sequenceDiagram
+```plantuml
+@startuml
+autonumber
 
-participant usr as User
-participant app as Application
-participant ewc as Energy Web Chain
+actor User as usr
+participant Application as app
+participant "Energy Web \nChain" as ewc
 
-usr ->> app: this is my DID
-app ->> ewc: check that the identity is still valid
-ewc -->> app: confirm validity
-app -->> usr: here are some random bytes
-usr ->> usr: sign the challenge
-usr ->> app: this is my signature
-app ->> app: get DID from signature signature
-app ->> ewc: is this DID an owner?
-ewc -->> app: confirm ownership status
-app -->> usr: confirm login
+usr -> app: this is my DID
+app -> ewc: check that the identity is still valid
+ewc --> app: confirm validity
+app --> usr: here are some random bytes
+
+usr -> usr: sign the challenge
+usr -> app: this is my signature
+app -> app: get DID from signature 
+app -> ewc: is this DID an owner?
+ewc --> app: confirm ownership status
+app --> usr: confirm login
+@enduml
 ```
 
 #### Message formats
